src/Documents/ВходящийКаталогТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Document>
		<Properties>
			<Name>ВходящийКаталогТоваров</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьОжиданияОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПолныйКаталог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИсходящийЗапросКаталога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектронногоОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектронногоОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдТовараПоставщика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеНоменклатурыКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКЕИ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СвойстваНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаТаблицыТовары</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеСвойства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСвойства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШтрихКодыНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаТаблицыТовары</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКодКонтрагента</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьШтрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКачество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеШтрихкода</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НоменклатураКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураКонтрагентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодНоменклатурыКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АртикулНоменклатурыКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеНоменклатурыКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтрихКодНоменклатурыКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаНоменклатурыКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>110</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ИсходящийЗапросКаталога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.0">
	<Document>
		<Properties>
			<Name>ИсходящийЗапросКаталога</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьОжиданияОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектронногоОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектронногоОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ВходящийКаталогТоваров/Ext/ObjectModule.bsl
Функция ПроверитьУникальностьШтрихКода(ШтрихКод) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.Штрихкоды КАК Штрихкоды
				   |ГДЕ
				   |Штрихкоды.Штрихкод = &ШтрихКод ";
				   
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДанных;
	
КонецФункции

Функция ЗагрузитьЭлементХМЛ(ОбъектXML, ИмяУзла, Параметры) Экспорт
	
	Перем СтрокаТовара;
	
	Параметры.Свойство("СтрокаТовара", СтрокаТовара);
	
	Если ИмяУзла = "КаталогТоваров" Тогда
		
	ИначеЕсли ИмяУзла = "НомерИсходногоДокумента" Тогда
		ИсходныйДокумент = ЭлектронныеДокументы.ПолучитьСсылкуНаДокументПоДаннымИзXML(ОбъектXML, Документы.ИсходящийЗапросКаталога.ПустаяСсылка(), Параметры);
	ИначеЕсли ИмяУзла = "ДлительностьОжиданияОтвета" Тогда
		ДлительностьОжиданияОтвета = ЭлектронныеДокументы.ПолучитьДлительностьЭлемента(ОбъектXML);
	ИначеЕсли ИмяУзла = "ЭтоПолныйКаталог" Тогда
		ЭтоПолныйКаталог = ЭлектронныеДокументы.ПолучитьБулевоЭлемента(ОбъектXML);
	ИначеЕсли ИмяУзла = "Товар" Тогда
			
		СтрокаТовара = Товары.Добавить();
		Параметры.Вставить("СтрокаТовара",СтрокаТовара);
			
	ИначеЕсли ИмяУзла = "ИдТовараПоставщика" Тогда
		
		СтрокаТовара.ИдТовараПоставщика = ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML);
		
	ИначеЕсли ИмяУзла = "ИдТовараКлиента" Тогда
		
		ЭлектронныеДокументы.ЗаполнитьНоменклатуруИХарактеристикуПоИдентификатору(СтрокаТовара, ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML), Параметры);
		
	ИначеЕсли ИмяУзла = "Наименование" Тогда
			
		СтрокаТовара.НаименованиеНоменклатурыКонтрагента = ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML);
			
	ИначеЕсли ИмяУзла = "ОКЕИ" Тогда
			
		СтрокаТовара.ОКЕИ = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML));
		Если ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			СтрокаТовара.ЕдиницаИзмерения = ЭлектронныеДокументы.ПолучитьЕдиницуИзмеренияНоменклатурыПоКлассификатору(СтрокаТовара.Номенклатура, СтрокаТовара.ОКЕИ);
		КонецЕсли;
		
	ИначеЕсли ИмяУзла = "ШтриховойКод" Тогда
		
		СтрокаШтрихКода = ШтрихКодыНоменклатуры.Добавить();
		СтрокаШтрихКода.СтрокаТаблицыТовары  = СтрокаТовара.НомерСтроки;
		СтрокаШтрихКода.ШтрихКодКонтрагента = ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			
			ТаблицаШтрихКодов = ПроверитьУникальностьШтрихКода(Сред(СтрокаШтрихКода.ШтрихКодКонтрагента, 2));
			Если ТаблицаШтрихКодов.Количество() <> 0 Тогда
				
				СтрокаТовара.Номенклатура = ТаблицаШтрихКодов[0].Владелец;	
				СтрокаТовара.ХарактеристикаНоменклатуры = ТаблицаШтрихКодов[0].ХарактеристикаНоменклатуры;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли   ИмяУзла = "ОКП"
			или ИмяУзла = "ИСО3166"
			или ИмяУзла = "ОКВЭД"
			или ИмяУзла = "КлассификаторТовара"
			или ИмяУзла = "ТорговаяМарка"
			или ИмяУзла = "Производитель"
			или ИмяУзла = "ВесНетто"
			или ИмяУзла = "ВесБрутто"
			или ИмяУзла = "ВысотаСлояТовара"
			или ИмяУзла = "ВысотаТовара"
			или ИмяУзла = "ШиринаТовара"
			или ИмяУзла = "ГлубинаТовара"
			или ИмяУзла = "ОбъемТовара"
			или ИмяУзла = "МинКоличествоДляЗаказа"
			или ИмяУзла = "КоличествоВСлоеНаЕвропалете"
			или ИмяУзла = "ТемператураХранения"
			или ИмяУзла = "Кратность"
			или ИмяУзла = "КоличествоЕдиницОбъектаВерхнегоУровня"
			или ИмяУзла = "Примечание" Тогда
			
		Свойство = СвойстваНоменклатуры.Добавить();
		Свойство.СтрокаТаблицыТовары  = СтрокаТовара.НомерСтроки;
		Свойство.НаименованиеСвойства = ИмяУзла;
		Свойство.ЗначениеСвойства     = ЭлектронныеДокументы.ПолучитьТекстЭлементаХМЛ(ОбъектXML);
		
	ИначеЕсли ИмяУзла = "СрокХранения" Тогда
		
		Свойство = СвойстваНоменклатуры.Добавить();
		Свойство.СтрокаТаблицыТовары  = СтрокаТовара.НомерСтроки;
		Свойство.НаименованиеСвойства = ИмяУзла;
		Свойство.ЗначениеСвойства     = Формат(ЭлектронныеДокументы.ПолучитьДлительностьЭлемента(ОбъектXML), "ЧГ=");
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СуществуетИсходящийДокумент(СсылкаНаОтветныйДокумент = Неопределено) Экспорт
	
	СсылкаНаОтветныйДокумент = ЭлектронныеДокументы.НайтиПервыйОтветныйДокумент(Ссылка, "ИсходящийТоварКРаботе");
	
	Возврат ЗначениеЗаполнено(СсылкаНаОтветныйДокумент);
	
КонецФункции // () 

Процедура ПринятьКРаботе(Отказ, Сообщение, ДокументТоварКРаботе = Неопределено) Экспорт
	
	СсылкаНаИсходныйДокумент = Неопределено;
	Если СуществуетИсходящийДокумент(СсылкаНаИсходныйДокумент) Тогда
		
		Сообщение = Сообщение + Символы.ПС + "- На основании данного документа создан исходящий документ: """ + СсылкаНаИсходныйДокумент + "
		|Необходимо удалить исходящий документ и повторить операцию.";
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	СтрокиТовара = Товары.НайтиСтроки(Новый Структура("Пометка", Истина));
	
	Для каждого СтрокаДанных Из СтрокиТовара Цикл
		
		Если Не СтрокаДанных.ЕдиницаИзмерения.ЕдиницаПоКлассификатору = СтрокаДанных.ОКЕИ Тогда
			Сообщение = Сообщение + Символы.ПС + "- Строка: " + СтрокаДанных.НомерСтроки + ". Единица измерения """ + СтрокаДанных.ЕдиницаИзмерения + """ не соответствует классификатору контрагента """ + СтрокаДанных.ОКЕИ + """!";
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Для каждого СтрокаДанных Из СтрокиТовара Цикл
			
		Если Не ЗначениеЗаполнено(СтрокаДанных.ХарактеристикаНоменклатуры) Тогда
			ЭлектронныеДокументы.СоздатьИдентификаторыЭлОбмена(СтрокаДанных.Номенклатура);
		Иначе
			ЭлектронныеДокументы.СоздатьИдентификаторыЭлОбмена(СтрокаДанных.ХарактеристикаНоменклатуры);
		КонецЕсли;
			
		МенеджерЗаписи = РегистрыСведений.НоменклатураКонтрагентов.СоздатьМенеджерЗаписи();
			
		МенеджерЗаписи.Контрагент                          = Контрагент;
		МенеджерЗаписи.Номенклатура                        = СтрокаДанных.Номенклатура;
		МенеджерЗаписи.ХарактеристикаНоменклатуры          = СтрокаДанных.ХарактеристикаНоменклатуры;
		МенеджерЗаписи.КодНоменклатурыКонтрагента          = СтрокаДанных.ИдТовараПоставщика;
		МенеджерЗаписи.НаименованиеНоменклатурыКонтрагента = СтрокаДанных.НаименованиеНоменклатурыКонтрагента;
			
		МенеджерЗаписи.ЕдиницаНоменклатурыКонтрагента      = СтрокаДанных.ОКЕИ;
			
		ШтрихКодыНоменклатурыКонтрагента = ШтрихКодыНоменклатуры.НайтиСтроки(Новый Структура("СтрокаТаблицыТовары", СтрокаДанных.НомерСтроки));
		Для каждого СтрокаШтрихКода Из ШтрихКодыНоменклатурыКонтрагента Цикл
			МенеджерЗаписи.ШтрихКодНоменклатурыКонтрагента  = Сред(СтрокаШтрихКода.ШтрихКодКонтрагента, 2);
			Прервать;
		КонецЦикла;
			
		Попытка
			МенеджерЗаписи.Записать();
		Исключение
			Сообщение = Сообщение + Символы.ПС + "- " + ОписаниеОшибки();
			Отказ = Истина;
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки; 
		
	КонецЦикла;
	
	Обработан = Истина;
	
	Попытка
		Записать();
	Исключение
		Сообщение = Сообщение + Символы.ПС + "- " + ОписаниеОшибки();
		Отказ = Истина;
		ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
	
	ДокументТоварКРаботе = Документы.ИсходящийТоварКРаботе.СоздатьДокумент();
	ДокументТоварКРаботе.Заполнить(ссылка);

	Попытка
		ДокументТоварКРаботе.Записать();
	Исключение
		Сообщение = Сообщение + Символы.ПС + "- " + ОписаниеОшибки();
		Отказ = Истина;
		ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры // ()
